app/views/messages/_group.html.haml

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
---
  .group-contents
    %h4.group-contents__title