app/views/messages/create.json.jbuilder

json.image @message.image
json.created_at @message.created_at
---
INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', '32187_main2.jpg', 2, 2, '2018-04-12 05:09:09', '2018-04-12 05:09:09')