app/views/messages/index.html.haml

      .group-contents
        %h4.group-contents__title サンプル
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1