app/controllers/groups_controller.rb

UPDATE `groups` SET `name` = 'テスト編集済', `updated_at` = '2018-04-04 03:15:55' WHERE `groups`.`id` = 2
---
  def update
      if @group.update(group_params)