app/controllers/groups_controller.rb

  def index
    @groups = current_user.groups
---
SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 2