app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 2 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 2
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def index
    @users = @group.users
    @messages = @group.messages.includes(:user)
    @message = Message.new
    respond_to do |format|
      format.html
      format.json { @new_message = @messages.where('id > ?', params[:message][:id]) }

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', '32187_main2.jpg', 2, 2, '2018-04-11 10:47:16', '2018-04-11 10:47:16')
---
  def create
    @message = @group.messages.new(message_params)
    if @message.save